TestPlans/Car/More Than Smart Wheels/xml/MSW3_08102014_11.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xs="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <Quote xmlns="http://TGSL/TES_Aggregator">
      <lxmlTGSLXML>
        <tgsl xmlns="http://www.transactorgsl.com/schemas">
          <aggregator>comparethemarket</aggregator>
          <domain>http://localhost</domain>
          <partner>
            <partnerName>trak</partnerName>
            <broker>morethan</broker>
          </partner>
          <product>motor</product>
        </tgsl>
      </lxmlTGSLXML>
      <lstrRiskXML>
        <p:motorRisk xmlns:p="http://www.transactorgsl.com/schemas" xmlns="http://www.transactorgsl.com/schemas">
          <p:insuredParty instance="1">
            <p:accessToOtherVehicles>false</p:accessToOtherVehicles>
            <p:client>true</p:client>
            <p:clubMember>0</p:clubMember>
            <p:criminalOffence>false</p:criminalOffence>
            <p:dateLicenceObtained>1989-10-08T00:00:00</p:dateLicenceObtained>
            <p:dob>1971-11-27T00:00:00</p:dob>
            <p:email>oliver.neal@emailreaction.org</p:email>
            <p:forename>Keith</p:forename>
            <p:homeOwner>true</p:homeOwner>
            <p:insurancePreviouslyRefused>false</p:insurancePreviouslyRefused>
            <p:licenceRestrictionsID>8</p:licenceRestrictionsID>
            <p:licenceTypeID>N</p:licenceTypeID>
            <p:mainDriver>true</p:mainDriver>
            <p:maritalStatusID>M</p:maritalStatusID>
            <p:mothersMaidenName />
            <p:numberOfVehiclesAccessTo>1</p:numberOfVehiclesAccessTo>
            <p:password>compareDM</p:password>
            <p:sex>M</p:sex>
            <p:surname>Eleven</p:surname>
            <p:titleID>003</p:titleID>
            <p:ukResidenceYears>42</p:ukResidenceYears>
            <p:vehicleUseID>01</p:vehicleUseID>
            <p:numberOfOtherVehiclesOwned>0</p:numberOfOtherVehiclesOwned>
            <p:numberOfVehiclesInFamily>0</p:numberOfVehiclesInFamily>
          </p:insuredParty>
          <p:insuredParty instance="2">
            <p:accessToOtherVehicles>false</p:accessToOtherVehicles>
            <p:client>false</p:client>
            <p:clubMember>0</p:clubMember>
            <p:criminalOffence>false</p:criminalOffence>
            <p:dateLicenceObtained>2010-10-08T00:00:00</p:dateLicenceObtained>
            <p:dob>1986-04-14T00:00:00</p:dob>
            <p:email />
            <p:forename>Karl</p:forename>
            <p:homeOwner>true</p:homeOwner>
            <p:insurancePreviouslyRefused>false</p:insurancePreviouslyRefused>
            <p:licenceRestrictionsID>8</p:licenceRestrictionsID>
            <p:licenceTypeID>N</p:licenceTypeID>
            <p:mainDriver>false</p:mainDriver>
            <p:maritalStatusID>M</p:maritalStatusID>
            <p:mothersMaidenName />
            <p:relationshipID>A</p:relationshipID>
            <p:password>compareDM</p:password>
            <p:sex>M</p:sex>
            <p:surname>Eleven</p:surname>
            <p:titleID>003</p:titleID>
            <p:ukResidenceYears>3</p:ukResidenceYears>
            <p:vehicleUseID>01</p:vehicleUseID>
            <p:numberOfOtherVehiclesOwned>0</p:numberOfOtherVehiclesOwned>
            <p:numberOfVehiclesInFamily>0</p:numberOfVehiclesInFamily>
          </p:insuredParty>
          <p:correspondanceAddress instance="1">
            <p:city>Malvern</p:city>
            <p:country />
            <p:county>Worcestershire</p:county>
            <p:house>2</p:house>
            <p:locality />
            <p:postcode>WR14 1AZ</p:postcode>
            <p:street>Duke of Edinburgh Way</p:street>
          </p:correspondanceAddress>
          <p:occupation instance="1" insuredPartyInstance="1">
            <p:employersBusinessID>186</p:employersBusinessID>
            <p:employmentStatusID>R</p:employmentStatusID>
            <p:occupationID>R09</p:occupationID>
            <p:parttime>false</p:parttime>
            <p:primaryOccupation>true</p:primaryOccupation>
          </p:occupation>
          <p:occupation instance="1" insuredPartyInstance="2">
            <p:employersBusinessID>186</p:employersBusinessID>
            <p:employmentStatusID>F</p:employmentStatusID>
            <p:occupationID>49D</p:occupationID>
            <p:parttime>false</p:parttime>
            <p:primaryOccupation>true</p:primaryOccupation>
          </p:occupation>
          <p:telephone instance="1">
            <p:telephoneNumber>01734320301</p:telephoneNumber>
            <p:telephoneTypeID>3AJPQ7C4</p:telephoneTypeID>
          </p:telephone>
          <p:conviction instance="1" insuredPartyInstance="1">
            <p:banLengthInMonths>0</p:banLengthInMonths>
            <p:dateOfConviction>2011-02-01T00:00:00</p:dateOfConviction>
            <p:disqualified>false</p:disqualified>
            <p:fine>114</p:fine>
            <p:offenceCodeID>DR10</p:offenceCodeID>
            <p:pending>false</p:pending>
            <p:points>0</p:points>
          </p:conviction>
          <p:claim instance="1" insuredPartyInstance="1">
            <p:atFault>true</p:atFault>
            <p:claimDetailsID />
            <p:claimStatusID>001</p:claimStatusID>
            <p:claimTypeID>T</p:claimTypeID>
            <p:dateOfClaim>2011-07-01T00:00:00</p:dateOfClaim>
            <p:injuryInvolved>false</p:injuryInvolved>
            <p:ncdAffected>false</p:ncdAffected>
            <p:totalCost>500.00</p:totalCost>
          </p:claim>
          <p:health instance="1" insuredPartyInstance="2">
            <p:dateDiagnosed>2013-10-08T00:00:00</p:dateDiagnosed>
            <p:dvlaNotified>true</p:dvlaNotified>
            <p:licenceExpiryDate />
            <p:licenceIssued>false</p:licenceIssued>
            <p:medicalConditionID>2</p:medicalConditionID>
          </p:health>
          <p:qualification instance="1" insuredPartyInstance="1">
            <p:datePassed>2008-05-31T00:00:00</p:datePassed>
            <p:qualificationID>3</p:qualificationID>
          </p:qualification>
          <p:cover instance="1">
            <p:coverRequiredID>01</p:coverRequiredID>
            <p:coverStartDate>2014-10-08T00:00:00</p:coverStartDate>
            <p:previousInsurance>true</p:previousInsurance>
            <p:previousInsuranceExpiryDate>2014-10-08T00:00:00</p:previousInsuranceExpiryDate>
            <p:previousInsurancePolicyNumber>1</p:previousInsurancePolicyNumber>
            <p:previousInsurerID>999</p:previousInsurerID>
            <p:voluntaryExcess>0</p:voluntaryExcess>
          </p:cover>
          <p:vehicle instance="1">
            <p:abiCode>52011702</p:abiCode>
            <p:annualMileage>4999</p:annualMileage>
            <p:bodyTypeID>01</p:bodyTypeID>
            <p:businessMileage>0</p:businessMileage>
            <p:currentMileage>0</p:currentMileage>
            <p:dateOfPurchase>2014-10-08T00:00:00</p:dateOfPurchase>
            <p:fuelTypeID>002</p:fuelTypeID>
            <p:gearboxTypeID>002</p:gearboxTypeID>
            <p:imported>false</p:imported>
            <p:increasedBHP>0</p:increasedBHP>
            <p:keeperID>9</p:keeperID>
            <p:kitCar>false</p:kitCar>
            <p:leftHandDrive>false</p:leftHandDrive>
            <p:modifiedWhilstOwned>false</p:modifiedWhilstOwned>
            <p:numberOfDoors>5</p:numberOfDoors>
            <p:numberOfSeats>5</p:numberOfSeats>
            <p:ownerID>9</p:ownerID>
            <p:overnightParkingID>1</p:overnightParkingID>
            <p:pricePaid>2345</p:pricePaid>
            <p:qPlated>false</p:qPlated>
            <p:registrationNumber>X779NBM</p:registrationNumber>
            <p:usedForTrackDays>false</p:usedForTrackDays>
            <p:value>2345</p:value>
            <p:vehicleCC>1389</p:vehicleCC>
            <p:vehicleMake>Vauxhall</p:vehicleMake>
            <p:vehicleModel>Astra</p:vehicleModel>
            <p:yearOfManufacture>2000</p:yearOfManufacture>
          </p:vehicle>
          <p:ncd instance="1">
            <p:ncdYears>20</p:ncdYears>
            <p:protectedNCD>false</p:protectedNCD>
          </p:ncd>
          <p:garageAddress instance="1">
            <p:city>Malvern</p:city>
            <p:country />
            <p:county>Worcestershire</p:county>
            <p:house>2</p:house>
            <p:locality />
            <p:postcode>WR14 1AZ</p:postcode>
            <p:street>Duke of Edinburgh Way</p:street>
          </p:garageAddress>
          <p:security instance="1">
            <p:dateFitted>2014-10-08T00:00:00</p:dateFitted>
            <p:fittedByID>4</p:fittedByID>
            <p:securityID>93</p:securityID>
          </p:security>
        </p:motorRisk>
      </lstrRiskXML>
    </Quote>
  </soap:Body>
</soap:Envelope>